# IsActiveOnElement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementRoundingManager..::..IsActiveOnElement Property
ReinforcementRoundingManager Class See Also
---
Defines whether reinforcement rounding is activated for the particular element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsActiveOnElement { get; set; }
```

Visual Basic
---
```text
Public Property IsActiveOnElement As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsActiveOnElement {
	bool get ();
	void set (bool value);
}
```

# Remarks
If these overrides relate to ReinforcementSettings, this property is shared for Rebar and Fabric related elements. Toggling this value will toggle the settings for both kinds of Reinforcement elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: Reinforcement rounding overrides for this element cannot be enabled because overrides are not enabled for ReinforcementSettings. |

# See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace